Repository: Progetto-Gigapixel/Integrator
Catalog: modules/shaft/locales/*/LC_MESSAGES/gigapixel.po
Languages: it

source: Running Analysis Mode...
it: Esecuzione modalità Analisi...

source: Analysis Mode completed successfully.
it: Modalità Analisi completata con successo.

source: Running Development Mode...
it: Esecuzione modalità Sviluppo...

source: No EXIF data found.
it: Nessun dato EXIF trovato.

source: Transferring EXIF metadata...
it: Trasferimento dei metadati EXIF...

source: EXIF metadata transferred successfully.
it: Metadati EXIF trasferiti con successo.

source: Saving the resulting image...
it: Salvataggio dell'immagine...

source: In 'AM' mode, the input must be a single RAW file.
it: In modalità 'AM', l'input deve essere un singolo file RAW.

source: Decoding RAW file...
it: Decodifica del file RAW...

source: The specified path is neither a file nor a directory: {input_path}
it: Il percorso specificato non è né un file né una directory: {input_path}

source: RAW file decoded successfully.
it: File RAW decodificato con successo.

source: Applying geometric correction...
it: Applicazione correzione geometrica...

source: Geometric correction applied successfully.
it: Correzione geometrica applicata con successo.

source: The process was interrupted by the user.
it: Il processo è stato interrotto dall'utente.

source: RAW DECODER: {DRE.message}
it: DECODIFICATORE RAW: {DRE.message}

source: Distortion coefficients collected: {}
it: Coefficienti di distorsione raccolti: {}

source: Camera crop factor received: {}
it: Fattore di ritaglio della fotocamera ricevuto: {}

source: Do you want to proceed with manual geometric correction? (y/n):
it: Vuoi procedere con la correzione geometrica manuale? (s/n):

source: y
it: s

source: Enter the crop factor of your camera (e.g., 1.5):
it: Inserisci il fattore di ritaglio della tua fotocamera (ad es., 1.5):

source: Enter coefficient k{} (e.g., -0.01):
it: Inserisci il coefficiente k{} (ad es., -0.01):

source: Do you want to include tangential coefficients p1 and p2? (y/n):
it: Vuoi includere i coefficienti tangenziali p1 e p2? (s/n):

source: Tangential coefficients p1 and p2 will be set to 0.0.
it: I coefficienti tangenziali p1 e p2 verranno impostati a 0.0.

source: Please enter a positive value.
it: Inserisci un valore positivo.

source: Invalid value. Please enter a valid value of type {}.
it: Valore non valido. Inserisci un valore valido di tipo {}.

source: [Default: {default}]
it: [Predefinito: {default}]

source: [Choices: {choices}]
it: [Scelte: {choices}]

source: Parameter: {opts_long} ({opts}){default}
it: Parametro: {opts_long} ({opts}){default}

source: Argument: {arg_fmt}{choices}
it: Argomento: {arg_fmt}{choices}

source: Description: {original_help}
it: Descrizione: {original_help}

source: Cocoa - Color Correction
it: Cocoa - Interfaccia CLI

source: Analysis (AM)
it: Analisi (AM)

source: Development (DM)
it: Sviluppo (DM)

source: Analysis Mode
it: Modalità Analisi

source: Development Mode
it: Modalità Sviluppo

source: Batch Processing
it: Elaborazione batch

source: Lensfunpy Database Data Entry
it: Inserimento dati nel database di Lensfunpy

source: Distortion Model:
it: Modello di Distorsione:

source: Distance:
it: Distanza:

source: Camera Data
it: Dati Fotocamera

source: Maker:
it: Produttore:

source: Model:
it: Modello:

source: Mount:
it: Attacco:

source: Lens Data
it: Dati Obiettivo

source: Focal Length:
it: Lunghezza Focale:

source: Save
it: Salva

source: Please enter all the required fields.
it: Inserisci tutti i campi obbligatori.

source: Success
it: Successo

source: Select File
it: Seleziona file

source: Analyze Color Checker
it: Analizza Color Checker

source: Select RAW File
it: Seleziona file RAW

source: Would you like to add the missing data?
it: Desideri aggiungere i dati mancanti?

source: Start
it: Avvia

source: Skip
it: Salta

source: Warning!
it: Attenzione!

source: Select main folder
it: Seleziona cartella principale

source: Browse...
it: Sfoglia...

source: Select destination folder
it: Seleziona la cartella di destinazione.

source: Batch Mode
it: Modalità batch

source: Start Processing
it: Avvia elaborazione

source: Select Main Folder
it: Seleziona cartella principale

source: Select Destination Folder
it: Seleziona la modalità di operazione.

source: The batch processing has started. Please wait...
it: L'elaborazione batch è iniziata. Attendere...

source: Batch processing is complete.
it: Elaborazione batch completata.

source: No correction file selected
it: Nessun file di correzione selezionato

source: Select Correction File
it: Seleziona file di correzione

source: No folder selected
it: Nessuna cartella selezionata

source: Select RAW Images Folder
it: Seleziona cartella immagini RAW

source: Select Folder Containing RAW Images
it: Seleziona cartella contenente immagini RAW
